{
 "cells": [
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:05.623632900Z",
     "start_time": "2026-03-23T15:09:05.575003600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "EXTRA_YEARS = 0\n",
    "\n",
    "start = \"2025-01-01T00:00:00+01:00\"\n",
    "end = f\"{2025+1}-12-31T23:59:59+01:00\""
   ],
   "id": "7da745d4e09f71d3",
   "outputs": [],
   "execution_count": 1
  },
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "is_executing": true
    },
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:06.321727400Z",
     "start_time": "2026-03-23T15:09:05.627147500Z"
    }
   },
   "source": [
    "from IPython.core.interactiveshell import InteractiveShell\n",
    "\n",
    "import datetime\n",
    "\n",
    "InteractiveShell.ast_node_interactivity = \"all\"\n",
    "\n",
    "# Import pandas\n",
    "import pandas as pd\n",
    "\n",
    "pd.set_option('display.width', 2000)\n",
    "\n",
    "# Import logging and surpress warnings\n",
    "import logging\n",
    "\n",
    "logging.getLogger(\"neo4j\").setLevel(logging.ERROR)\n",
    "logging.getLogger(\"pd\").setLevel(logging.ERROR)\n",
    "\n",
    "# Import Path\n",
    "from pathlib import Path\n",
    "\n",
    "# Import promg\n",
    "from promg.modules.db_management import DBManagement\n",
    "from promg import SemanticHeader, DatasetDescriptions, OcedPg, Query"
   ],
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:06.423410100Z",
     "start_time": "2026-03-23T15:09:06.403572700Z"
    }
   },
   "cell_type": "code",
   "source": "from util.db_helper_functions import get_db_connection, get_config",
   "id": "915d24c1f0a696ca",
   "outputs": [],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:06.455407100Z",
     "start_time": "2026-03-23T15:09:06.434443100Z"
    }
   },
   "cell_type": "code",
   "source": "conf_path = Path('config.yaml')",
   "id": "33f3a11ea41be3a0",
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:06.519608300Z",
     "start_time": "2026-03-23T15:09:06.465449100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "config = get_config(conf_path)\n",
    "db_connection = get_db_connection(config)"
   ],
   "id": "3467173721bdfef9",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: libraries\n",
      "----------------------\n",
      "If you have other credentials, please change them at: config.yaml\n"
     ]
    }
   ],
   "execution_count": 5
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "\n",
    "### Clear Database"
   ],
   "id": "bcc5b0a602e13f3c"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:06.532055Z",
     "start_time": "2026-03-23T15:09:06.520606300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "dataset_descriptions = DatasetDescriptions(config=config)\n",
    "semantic_header = SemanticHeader.create_semantic_header(config=config)\n",
    "db_manager = DBManagement(db_connection=db_connection, semantic_header=semantic_header)\n",
    "data_loader = OcedPg(database_connection=db_connection,\n",
    "                     dataset_descriptions=dataset_descriptions,\n",
    "                     semantic_header=semantic_header)"
   ],
   "id": "548d093275cb336e",
   "outputs": [],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:10.379414200Z",
     "start_time": "2026-03-23T15:09:06.535577700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_manager.clear_db()\n",
    "db_manager.set_constraints()"
   ],
   "id": "e99ace79acd5df33",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1it [00:03,  3.41s/it, clear_db: took 3.43 seconds]"
     ]
    },
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2it [00:03,  1.64s/it, set_constraints: took 0.4 seconds]"
     ]
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:10.448515Z",
     "start_time": "2026-03-23T15:09:10.389730500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# set_index_on_validitiy_intervals for States\n",
    "db_connection.exec_query('''\n",
    "                         CREATE INDEX validityIntervals FOR (st: State) ON (st.validFrom, st.validTo)\n",
    "                         ''')"
   ],
   "id": "609553f0a5178183",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:23.750215200Z",
     "start_time": "2026-03-23T15:09:10.450510400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "start_build = datetime.datetime.now()\n",
    "print(f'Started at {start_build}')\n",
    "data_loader.load()"
   ],
   "id": "4667e24419aa54f2",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Started at 2026-03-23 16:09:10.454000\n",
      "10it [00:17,  2.09s/it, _filter_nodes for EventLog: took 0.0 seconds]                     "
     ]
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:09:49.786389400Z",
     "start_time": "2026-03-23T15:09:23.766368700Z"
    }
   },
   "cell_type": "code",
   "source": "data_loader.transform()",
   "id": "5a2b6f7c9f7f8c3c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "25it [00:43,  1.56s/it, _create_relations_using_record for (m ) - [:MEMBER_OF] -> (l ): took 1.16 seconds]                                                                                                                                                                                                           "
     ]
    }
   ],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:06.358685800Z",
     "start_time": "2026-03-23T15:09:49.794769100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# delete all records\n",
    "db_connection.exec_query('''\n",
    "    :auto\n",
    "    MATCH (l:Log) - [contains:CONTAINS] -> (r:Record)\n",
    "    CALL (contains) {\n",
    "        DELETE contains\n",
    "    } IN TRANSACTIONS\n",
    "''')\n",
    "\n",
    "# delete all records\n",
    "db_connection.exec_query('''\n",
    "    :auto\n",
    "    MATCH (l:Log)\n",
    "    CALL (l) {\n",
    "        DETACH DELETE l\n",
    "    } IN TRANSACTIONS\n",
    "''')\n",
    "\n",
    "# delete all records\n",
    "db_connection.exec_query('''\n",
    "    :auto\n",
    "    MATCH (r:Record) <- [ex:EXTRACTED_FROM] - (n)\n",
    "    CALL (ex) {\n",
    "        DELETE ex\n",
    "    } IN TRANSACTIONS\n",
    "''')\n",
    "\n",
    "# delete all records\n",
    "db_connection.exec_query('''\n",
    "    :auto\n",
    "    MATCH (r:Record) - [iot:IS_OF_TYPE] -> (rt:RecordType)\n",
    "    CALL (iot) {\n",
    "        DELETE iot\n",
    "    } IN TRANSACTIONS\n",
    "''')\n",
    "\n",
    "# delete all records\n",
    "db_connection.exec_query('''\n",
    "    :auto\n",
    "    MATCH (r:Record)\n",
    "    CALL (r) {\n",
    "        DETACH DELETE r\n",
    "    } IN TRANSACTIONS\n",
    "''')\n",
    "\n",
    "db_connection.exec_query('''\n",
    "    :auto\n",
    "    MATCH (rt:RecordType)\n",
    "    CALL (rt) {\n",
    "        DETACH DELETE rt\n",
    "    } IN TRANSACTIONS\n",
    "''')"
   ],
   "id": "3d03d72b2bb793aa",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:06.479125500Z",
     "start_time": "2026-03-23T15:10:06.371692800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# copy over member attributes\n",
    "query = '''\n",
    "MATCH (m:Member)\n",
    "WITH m ORDER BY m.sysId, m.registrationId\n",
    "WITH m.sysId as memberId, min(m.registrationId) as first_registration, collect(m) as same_member\n",
    "WHERE size(same_member) > 1\n",
    "UNWIND range(1, size(same_member) - 1) as i\n",
    "WITH same_member[0] as full_member, same_member[i] as new_member\n",
    "SET new_member += {firstName: full_member.firstName, lastName: full_member.lastName, dateOfBirth: full_member.dateOfBirth, ageCategory:full_member.ageCategory}\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(query)"
   ],
   "id": "49cf3090bca99cef",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 12
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Add interval of events",
   "id": "464c9cca1fa0e082"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:07.424480100Z",
     "start_time": "2026-03-23T15:10:06.497507500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "add_interval_to_events = '''\n",
    "MATCH (e:Event)\n",
    "SET e.validFrom = e.timestamp, e.validTo = e.timestamp\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(add_interval_to_events)"
   ],
   "id": "df003493c5126216",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 13
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:10.358012300Z",
     "start_time": "2026-03-23T15:10:07.441031400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "add_interval_to_observes = '''\n",
    ":auto\n",
    "MATCH (e:Event) - [c:OBSERVES] -> (n)\n",
    "CALL (e,c){\n",
    "    SET c.validFrom = e.timestamp, c.validTo = e.timestamp\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(add_interval_to_observes)"
   ],
   "id": "9490f2a361726e00",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:10.424800600Z",
     "start_time": "2026-03-23T15:10:10.371683500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query(Query(query_str='''\n",
    "                                         WITH datetime($start) as start_date, datetime($end) as end_date\n",
    "                                             MATCH (l:Library)\n",
    "                                         SET l.validFrom = start_date\n",
    "                                         SET l.validTo = end_date\n",
    "                                         ''',\n",
    "                               parameters={\n",
    "                                   \"start\": start,\n",
    "                                   \"end\": end\n",
    "                               }))"
   ],
   "id": "fdbba6deeeeb7dc7",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 15
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Add Intervals to `Member` Object\n",
    "\n",
    "We'll go through each object type and relationship type in our process and look at the Oracle.\n",
    "Let's start with 'Member'.\n",
    "\n",
    "- f<sub>Member</sub>(Register Member) = Create and f<sub>MEMBER_OF</sub>(Register Member) = Create\n",
    "- f<sub>Member</sub>(Deregister Member) = Delete and f<sub>MEMBER_OF</sub>(Deregister Member) = Delete\n",
    "\n",
    "- f<sub>Member</sub>(Borrow book) = Read\n",
    "- f<sub>Member</sub>(Extend book) = Read\n",
    "- f<sub>Member</sub>(Return book) = Read\n",
    "\n",
    "- f<sub>Member</sub>(Reserve Book) = Read\n",
    "- f<sub>Member</sub>(Increase fine) = Update (fine attribute)\n",
    "- f<sub>Member</sub>(Pay fine) = Update (fine attribute)"
   ],
   "id": "b7e9a4c940ad6265"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:10.877490200Z",
     "start_time": "2026-03-23T15:10:10.435085800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query('''\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity = 'Register Member'\n",
    "    SET m.validFrom = e.timestamp, m.subscriptionType = e.subscriptionType\n",
    "    MERGE (m) - [:HAS_STATE] -> (st:State {validFrom: e.timestamp})\n",
    "    SET st.fine = 0\n",
    "''')\n",
    "\n",
    "db_connection.exec_query('''\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity = 'Deregister Member'\n",
    "    SET m.validTo = e.timestamp\n",
    "''')\n",
    "\n",
    "db_connection.exec_query(Query(query_str='''\n",
    "                                         WITH datetime($start) as start_date, datetime($end) as end_date\n",
    "                                             MATCH (m:Member)\n",
    "                                         SET m.validFrom = COALESCE (m.validFrom, start_date)\n",
    "                                         SET m.validTo = COALESCE (m.validTo, end_date)\n",
    "\n",
    "                                         ''',\n",
    "                               parameters={\n",
    "                                   \"start\": start,\n",
    "                                   \"end\": end\n",
    "                               }))\n",
    "\n"
   ],
   "id": "9b8a37e8008c0e83",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 16
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:10.956856900Z",
     "start_time": "2026-03-23T15:10:10.879479700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query('''\n",
    "    MATCH (m:Member) - [member_of:MEMBER_OF] -> (l:Library)\n",
    "    WITH member_of, m, l,\n",
    "        CASE WHEN m.validFrom >= l.validFrom THEN m.validFrom ELSE l.validFrom END as start_value, //take max(m.validFrom, l.validFrom)\n",
    "        CASE WHEN m.validTo <= l.validTo THEN m.validTo ELSE l.validTo END as end_value //take min(m.validTo, l.validTo)\n",
    "    SET member_of.validFrom = start_value,\n",
    "        member_of.validTo = end_value\n",
    "''')"
   ],
   "id": "e3d6faa200bb681d",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 17
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Set initial state",
   "id": "3cb6822e060a1257"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:11.312742Z",
     "start_time": "2026-03-23T15:10:10.968375600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# first, we use the initial fine amount when the first recorded event is not Increase fine.\n",
    "# Then we can use the recorded fine attribute\n",
    "\n",
    "db_connection.exec_query('''\n",
    "    MATCH (m:Member)\n",
    "    WHERE NOT EXISTS ((m) - [:HAS_STATE] -> (:State))\n",
    "    CALL (m) {\n",
    "      MATCH (m) <- [:OBSERVES] - (e:Event)\n",
    "      RETURN e ORDER BY e.timestamp LIMIT 1\n",
    "    }\n",
    "    WITH m, e\n",
    "    WHERE e.activity <> 'Increase fine'\n",
    "    MERGE (m) - [:HAS_STATE] -> (st:State {validFrom: m.validFrom})\n",
    "    SET st.fine = e.fineAmount\n",
    "''')"
   ],
   "id": "1f00b8ef5007e34",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 18
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:11.767398100Z",
     "start_time": "2026-03-23T15:10:11.327282500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query('''\n",
    "    MATCH (m:Member)\n",
    "    WHERE NOT EXISTS ((m) - [:HAS_STATE] -> (:State))\n",
    "        CALL (m) {\n",
    "          MATCH (m) <- [:OBSERVES] - (e:Event)\n",
    "          RETURN e ORDER BY e.timestamp LIMIT 1\n",
    "        }\n",
    "    WITH e, m\n",
    "    CALL (e, m) {\n",
    "          MATCH (m) <- [:OBSERVES] - (f:Event)\n",
    "          WHERE f.activity IN ['Increase fine', 'Pay fine']\n",
    "          AND f <> e // find next event that is not e\n",
    "          RETURN f ORDER BY f.timestamp LIMIT 1\n",
    "    }\n",
    "    WITH e, f, m,\n",
    "    CASE f.activity\n",
    "    WHEN 'Increase fine' THEN e.fineAmount - (f.fineAmount - e.fineAmount) // take current fine - difference between two consecutive increases\n",
    "    WHEN 'Pay fine' THEN -0.1\n",
    "    END AS initial_fine\n",
    "    MERGE (m) - [:HAS_STATE] -> (st:State {validFrom: m.validFrom})\n",
    "    SET st.fine = initial_fine\n",
    "''')"
   ],
   "id": "8218d1dbf243c62c",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 19
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:11.874660700Z",
     "start_time": "2026-03-23T15:10:11.778913900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# then there are some members that have not interacted with the library in this year, we don't know anything about their state\n",
    "db_connection.exec_query('''\n",
    "    MATCH (m:Member)\n",
    "    WHERE NOT EXISTS ((m) - [:OBSERVES] - (:Event))\n",
    "    AND NOT EXISTS ((m) - [:HAS_STATE] -> (:State))\n",
    "    MERGE (m) - [:HAS_STATE] -> (st:State {validFrom: m.validFrom})\n",
    "    SET st.fine = -0.1\n",
    "''')"
   ],
   "id": "159fee4b0f959ef9",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 20
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:27.644538700Z",
     "start_time": "2026-03-23T15:10:11.896276400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query('''\n",
    "    :auto\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity IN ['Pay fine', 'Increase fine']\n",
    "    CALL (m, e) {\n",
    "        MERGE (m) - [:HAS_STATE] -> (st:State {validFrom: e.timestamp})\n",
    "        SET st.fine = e.fineAmount\n",
    "    } IN TRANSACTIONS\n",
    "''')"
   ],
   "id": "2638247e974090d4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 21
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# complete states `Member`",
   "id": "4a5d4232de942352"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:29.238821100Z",
     "start_time": "2026-03-23T15:10:27.662184100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "order_states = '''\n",
    ":auto\n",
    "MATCH (m:Member) - [:HAS_STATE] -> (st:State)\n",
    "WITH m, st ORDER BY st.validFrom\n",
    "WITH m, collect(st) as member_states\n",
    "UNWIND range(0, size(member_states) - 2) as index\n",
    "WITH member_states[index] as first, member_states[index+1] as second\n",
    "CALL (first, second) {\n",
    "    MERGE (first) - [:NEXT] -> (second)\n",
    "} IN TRANSACTIONS'''\n",
    "\n",
    "db_connection.exec_query(order_states)"
   ],
   "id": "f04be7476f79bf5a",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 22
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:29.400672Z",
     "start_time": "2026-03-23T15:10:29.252412800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "copy_over_properties = '''\n",
    "    MATCH (m:Member) - [:HAS_STATE] ->  (st:State)\n",
    "    WHERE st[$prop] is NULL\n",
    "    MATCH (prev) - [:NEXT] -> (st)\n",
    "    SET st[$prop] = prev[$prop]\n",
    "    RETURN count(st) as count\n",
    "'''\n",
    "\n",
    "properties = ['fine']\n",
    "for prop in properties:\n",
    "    count = 1\n",
    "\n",
    "    while count > 0:\n",
    "        result = db_connection.exec_query(query=Query(copy_over_properties,\n",
    "                                                      parameters={\"prop\": prop}))\n",
    "        count = result[0]['count']\n",
    "        print(count)\n"
   ],
   "id": "99e9c3c83fa3d7d0",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n"
     ]
    }
   ],
   "execution_count": 23
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:30.864114Z",
     "start_time": "2026-03-23T15:10:29.416748600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "determine_to_state = '''\n",
    "    MATCH (m:Member) - [:HAS_STATE] ->  (st:State)\n",
    "    MATCH (st) - [:NEXT] -> (successor)\n",
    "    SET st.validTo = successor.validFrom\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(determine_to_state)\n",
    "\n",
    "determine_to_end_state = '''\n",
    "    MATCH (m:Member) - [:HAS_STATE] ->  (st:State)\n",
    "    WHERE NOT EXISTS((st) - [:NEXT] -> (:State))\n",
    "    SET st.validTo = m.validTo\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(determine_to_end_state)"
   ],
   "id": "af0f9a8842537318",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 24
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:31.078633500Z",
     "start_time": "2026-03-23T15:10:30.880719Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# check whether two following states have different properties, if result is 0 then they all have different properties\n",
    "check_following_states = '''\n",
    "MATCH (m:Member) - [:HAS_STATE] -> (st1:State) - [:NEXT] -> (st2:State)\n",
    "WHERE st1.fine = st2.fine\n",
    "RETURN count(m) as member_with_same_states\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(check_following_states)"
   ],
   "id": "7339c34b701238c0",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'member_with_same_states': 129}]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 25
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Add Intervals to `Book` Object",
   "id": "f54f1a3fb1ad1440"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "We'll go through each object type and relationship type in our process and look at the Oracle.\n",
    "Let's start with 'Book'.\n",
    "First of all, `Book` has a snapshot cardinality many-to-1 relationship with `Library` (a book is in the Catalog of one library).\n",
    "So that implies that whenever we create or delete a book, we should create and delete the `IN_CATALOG` relationship.\n",
    "\n",
    "\n",
    "- f<sub>Book</sub>(Add Book To Catalogue) = Create and f<sub>IN_CATALOG</sub>(Add Book To Catalogue) = Create\n",
    "- f<sub>Book</sub>(Remove Book From Catalogue) = Delete and f<sub>IN_CATALOG</sub>(Remove Book From Catalogue) = Delete\n",
    "\n",
    "- f<sub>Book</sub>(Borrow Book) = Update (available feature and Reserved feature) and f<sub>BORROWED_BY</sub>(Borrow Book) = Create\n",
    "- f<sub>Book</sub>(Extend Book) = Read and f<sub>BORROWED_BY</sub>(Borrow Book) = Update (Extend count)\n",
    "- f<sub>Book</sub>(Return Book) = Update (available feature) and f<sub>BORROWED_BY</sub>(Borrow Book) = Delete\n",
    "\n",
    "- f<sub>Book</sub>(Reserve Book) = Update (reserved feature)\n",
    "- f<sub>Book</sub>(Remove Reservation) = Update (reserved feature)"
   ],
   "id": "8db808af27331d86"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "### f<sub>Book</sub>(Add Book To Catalogue) = Create and f<sub>IN_CATALOG</sub>(Add Book To Catalogue) = Create\n",
    "First, we add the interval for the book object and the IN_CATALOG relationship.\n",
    "When a book is created, we can also create the initial state for the book. We know that the book has the following non-static properties: _available_ and _reserved_"
   ],
   "id": "d53b80f2ff81715a"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:31.251672600Z",
     "start_time": "2026-03-23T15:10:31.090373300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "add_book_to_catalogue = '''\n",
    "    MATCH (b:Book) - [:OBSERVES] - (e:Event)\n",
    "    MATCH (b:Book) <- [ic:IN_CATALOG] - (l:Library)\n",
    "    WHERE e.activity = 'Add Book To Catalogue'\n",
    "    SET b.validFrom = e.timestamp, ic.validFrom = e.timestamp\n",
    "    MERGE (b) - [:HAS_STATE] -> (state:State {validFrom: e.timestamp})\n",
    "    SET state.available = True, state.reserved=False\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(add_book_to_catalogue);"
   ],
   "id": "fb552a45f79c202b",
   "outputs": [],
   "execution_count": 26
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": " ### f<sub>Book</sub>(Remove Book From Catalogue) = Delete and f<sub>IN_CATALOG</sub>(Remove Book From Catalogue) = Delete",
   "id": "cf8a923c35d08d4a"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:31.375688Z",
     "start_time": "2026-03-23T15:10:31.256200200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "remove_book_from_catalogue = '''\n",
    "    MATCH (b:Book) - [:OBSERVES] - (e:Event)\n",
    "    MATCH (b:Book) <- [ic:IN_CATALOG] - (l:Library)\n",
    "    WHERE e.activity = 'Remove Book from Catalogue'\n",
    "    SET b.validTo = e.timestamp, ic.validTo = e.timestamp\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(remove_book_from_catalogue);"
   ],
   "id": "be81258e7edcf9ef",
   "outputs": [],
   "execution_count": 27
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "We know when books are created and deleted. If no Create event is recorded, then the Book existed from the start of Omega and if no Delete then until the end of Omega.",
   "id": "3e5295fae0368ba7"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:31.946379700Z",
     "start_time": "2026-03-23T15:10:31.378685100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "add_start_and_end = '''\n",
    "                    WITH datetime($start) as start_date, datetime($end) as end_date\n",
    "                        MATCH (b:Book) <- [ic:IN_CATALOG] - (l:Library)\n",
    "                    SET b.validFrom = COALESCE (b.validFrom, start_date), ic.validFrom = COALESCE (ic.validFrom, start_date), b.validTo = COALESCE (b.validTo, end_date), ic.validTo = COALESCE (ic.validTo, end_date)\n",
    "                    '''\n",
    "\n",
    "query = Query(query_str=add_start_and_end,\n",
    "              parameters={\n",
    "                  \"start\": start,\n",
    "                  \"end\": end\n",
    "              })\n",
    "db_connection.exec_query(query)"
   ],
   "id": "e917f13a897eab36",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 28
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:32.569685Z",
     "start_time": "2026-03-23T15:10:31.961942700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "add_initial_state_when_unknown = '''\n",
    "    MATCH (b:Book)\n",
    "    WHERE NOT EXISTS ((b) - [:HAS_STATE] -> (:State))\n",
    "    OPTIONAL CALL (b) {\n",
    "        MATCH (b) - [:OBSERVES] - (e:Event)\n",
    "        WHERE e.activity IN ['Borrow book', 'Extend book', 'Return book', 'Remove from Catalogue']\n",
    "        WITH e ORDER BY e.timestamp LIMIT 1\n",
    "        RETURN CASE e.activity\n",
    "        WHEN \"Borrow book\" THEN True\n",
    "        WHEN \"Extend book\" THEN False\n",
    "        WHEN \"Return book\" THEN False\n",
    "        WHEN \"Remove from Catalogue\" THEN True\n",
    "        END AS available_before_event, True as been_borrowed\n",
    "    }\n",
    "    OPTIONAL CALL (b) {\n",
    "        MATCH (b) - [:OBSERVES] - (e:Event)\n",
    "        WHERE e.activity IN ['Reserve book', 'Remove Reservation']\n",
    "        WITH e ORDER BY e.timestamp LIMIT 1\n",
    "        RETURN CASE e.activity\n",
    "        WHEN \"Reserve book\" THEN False\n",
    "        WHEN \"Remove Reservation\" THEN True\n",
    "        END AS reserved_before_event\n",
    "    }\n",
    "\n",
    "    MERGE (b) - [:HAS_STATE] -> (state:State {validFrom: b.validFrom})\n",
    "    SET state.available = COALESCE(available_before_event, 'unknown'), state.reserved= coalesce(reserved_before_event, not been_borrowed, 'unknown')\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(add_initial_state_when_unknown)"
   ],
   "id": "7a62860725351fa",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 29
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "### f<sub>Book</sub>(Borrow Book) = Update (available feature)\n",
    "\n",
    "Borrow Book also creates a BORROWED_BY relationship\n",
    "f<sub>BORROWED_BY</sub>(Borrow Book) = CREATE"
   ],
   "id": "85c07bac22cd6255"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:33.640724700Z",
     "start_time": "2026-03-23T15:10:32.582734900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "update_borrow_book_state_query = '''\n",
    "    MATCH (b:Book) <- [:OBSERVES] - (e:Event)\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity = 'Borrow book'\n",
    "    MERGE (b) - [:HAS_STATE] -> (state:State {validFrom: e.timestamp})\n",
    "    SET state.available = e.bookAvailable\n",
    "    WITH b, m, e ORDER BY e.timestamp\n",
    "    WITH b, m, collect(e) as borrowed_events\n",
    "    UNWIND range(0, size(borrowed_events) - 1) as i\n",
    "    WITH b, m, borrowed_events[i] as e, i as index\n",
    "    MERGE (b) - [:BORROWED_BY {validFrom: e.timestamp, relIndex: index, extendCount: 0}] ->  (m)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(update_borrow_book_state_query)"
   ],
   "id": "aa5d226941d61db4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 30
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "### f<sub>Book</sub>(Extend Book) = Read\n",
    "### f<sub>Borrowed By</sub>(Extend Book) = Update\n",
    "\n",
    "Extend Book updates the BORROWED_BY relationship\n",
    "f<sub>BORROWED_BY</sub>(Borrow Book) = Update"
   ],
   "id": "8c3798a1c0eddcc"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:34.621451200Z",
     "start_time": "2026-03-23T15:10:33.655721600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "update_extend_book_state_query = '''\n",
    "    MATCH (b:Book) <- [:OBSERVES] - (e:Event)\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity = 'Extend book'\n",
    "    CALL (m, b, e) {\n",
    "        MATCH (b) <- [:OBSERVES] - (f:Event)\n",
    "        MATCH (m) <- [:OBSERVES] - (f)\n",
    "        MATCH (b) - [bor:BORROWED_BY {validFrom: f.timestamp}] ->  (m)\n",
    "        WHERE f.activity = 'Borrow book' and f.timestamp <= e.timestamp\n",
    "        RETURN f, bor.relIndex as relIndex ORDER BY f.timestamp DESC LIMIT 1\n",
    "    }\n",
    "    CALL (m, b, e, f) {\n",
    "        MATCH (b) <- [:OBSERVES] - (g:Event)\n",
    "        MATCH (m) <- [:OBSERVES] - (g)\n",
    "        WHERE g.activity = 'Extend book' AND f.timestamp <= g.timestamp <= e.timestamp\n",
    "        RETURN count(distinct g) as extendCount\n",
    "    }\n",
    "\n",
    "    MERGE (b) - [:BORROWED_BY {validFrom: e.timestamp, extendCount: extendCount, relIndex: relIndex}] ->  (m)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(update_extend_book_state_query)"
   ],
   "id": "eb0e58237099082d",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 31
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "No Previous Borrow Book has been recorded (then previous query would not return anything)",
   "id": "66574cd5dd107092"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:34.992616100Z",
     "start_time": "2026-03-23T15:10:34.635133400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "extend_book_query_unknown_3 = '''\n",
    "MATCH (b:Book) <- [:OBSERVES] - (e:Event)\n",
    "MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "WHERE e.activity = 'Extend book' AND NOT EXISTS ((b) - [:BORROWED_BY {validFrom: e.timestamp}] -> (m)) //no borrowed relationship exists yet\n",
    "MERGE (b) - [:BORROWED_BY {validFrom: datetime($start), extendCount: 0, relIndex: -1}] ->  (m)\n",
    "WITH b, m, e ORDER BY e.timestamp\n",
    "WITH b, m, collect(e) as extend_events\n",
    "WHERE size(extend_events) = 3 // 3 is max number of Extensions, so we know the exact extendCount\n",
    "UNWIND range(0, size(extend_events) - 1) as i\n",
    "WITH b, m, extend_events[i] as event, i + 1 as extendCount\n",
    "MERGE (b) - [:BORROWED_BY {validFrom: event.timestamp, extendCount: extendCount, relIndex: -1}] ->  (m) //assumption, first recorded extend event is the first extend event (probably not always true)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(Query(query_str=extend_book_query_unknown_3,\n",
    "                               parameters={\n",
    "                                   \"start\": start,\n",
    "                                   \"end\": end\n",
    "                               }))"
   ],
   "id": "cb829fcb5451376f",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 32
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:35.384522700Z",
     "start_time": "2026-03-23T15:10:35.006209800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "extend_book_query_unknown_borrow = '''\n",
    "MATCH (b:Book) <- [:OBSERVES] - (e:Event)\n",
    "MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "WHERE e.activity = 'Extend book' AND NOT EXISTS ((b) - [:BORROWED_BY {validFrom: e.timestamp}] -> (m)) //no borrowed relationship exists yet\n",
    "MERGE (b) - [:BORROWED_BY {validFrom: datetime($start), extendCount: 'unknown', relIndex: -1}] ->  (m)\n",
    "\n",
    "WITH b, m, e ORDER BY e.timestamp\n",
    "WITH b, m, collect(e) as extend_events\n",
    "WHERE size(extend_events) < 3\n",
    "UNWIND range(0, size(extend_events) - 1) as i\n",
    "WITH b, m, extend_events[i] as event, 'unknown + ' + i + 1 as extendCount\n",
    "MERGE (b) - [:BORROWED_BY {validFrom: event.timestamp, extendCount: extendCount, relIndex: -1}] ->  (m)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(Query(query_str=extend_book_query_unknown_borrow,\n",
    "                               parameters={\n",
    "                                   \"start\": start,\n",
    "                                   \"end\": end\n",
    "                               }))"
   ],
   "id": "d3e2a47ca56afaf8",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 33
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "### f<sub>Book</sub>(Return Book) = Update (available feature)\n",
    "\n",
    "Return Book also deletes the BORROWED_BY relationship\n",
    "f<sub>BORROWED_BY</sub>(Borrow Book) = DELETE"
   ],
   "id": "fca98ca2959d2e0a"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:36.207944900Z",
     "start_time": "2026-03-23T15:10:35.396059300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# borrowed relationship might already exist (since previous query), so we need to find the previous relationship\n",
    "update_return_book_state_query = '''\n",
    "    MATCH (b:Book) <- [:OBSERVES] - (e:Event)\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity = 'Return book'\n",
    "    MERGE (b) - [:HAS_STATE] -> (state:State {validFrom: e.timestamp})\n",
    "    SET state.available = e.bookAvailable\n",
    "    WITH m, b, e\n",
    "    CALL (m, b, e) {\n",
    "        MATCH (b) - [bor:BORROWED_BY] -> (m)\n",
    "        WHERE bor.validFrom <= e.timestamp\n",
    "        RETURN bor ORDER BY bor.validFrom DESC LIMIT 1\n",
    "    }\n",
    "    SET bor.validTo = e.timestamp\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(update_return_book_state_query)"
   ],
   "id": "59c3ec1b9539ee7b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 34
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:36.535433100Z",
     "start_time": "2026-03-23T15:10:36.224637300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# borrowed relationship does not yet exist (can only hold for the first return book event for that (m, b) pair\n",
    "update_return_book_state_query = '''\n",
    "    MATCH (b:Book) <- [:OBSERVES] - (e:Event)\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity = 'Return book' AND NOT EXISTS ((b) - [:BORROWED_BY {validTo: e.timestamp}] -> (m)) //no borrowed relationship exists yet\n",
    "    MERGE (b) - [:BORROWED_BY {validTo: e.timestamp, relIndex: -1, extendCount: 'unknown'}] -> (m)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(update_return_book_state_query)"
   ],
   "id": "94fb0a07f56f121b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 35
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "### f<sub>Book</sub>(Reserve Book) = Update (reserved feature)\n",
    "Reserve Book also creates a RESERVED_BY relationship\n",
    "f<sub>RESERVED_BY</sub>(Borrow Book) = CREATE"
   ],
   "id": "72aadc9c7ab2fbd4"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:36.726230600Z",
     "start_time": "2026-03-23T15:10:36.545509500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "update_reserve_book_state_query = '''\n",
    "    MATCH (b:Book) <- [:OBSERVES] - (e:Event)\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity = 'Reserve book'\n",
    "    MERGE (b) - [:HAS_STATE] -> (state:State {validFrom: e.timestamp})\n",
    "    SET state.reserved = e.bookReserved\n",
    "    WITH b, m, e ORDER BY e.timestamp\n",
    "    WITH b, m, collect(e) as reserved_events\n",
    "    UNWIND range(0, size(reserved_events) - 1) as i\n",
    "    WITH b, m, reserved_events[i] as e, i as index\n",
    "    MERGE (b) - [:RESERVED_BY {validFrom: e.timestamp, relIndex: index}] ->  (m)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(update_reserve_book_state_query)"
   ],
   "id": "c20dc371d8c8ab0d",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 36
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### f<sub>Book</sub>(Remove Reservation) = Update (reserved feature)",
   "id": "162788dd91582432"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:37.000290100Z",
     "start_time": "2026-03-23T15:10:36.732524300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# borrowed relationship might already exist (since previous query), so we need to find the previous relationship\n",
    "update_remove_reservation_state_query = '''\n",
    "    MATCH (b:Book) <- [:OBSERVES] - (e:Event)\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity = 'Remove Reservation'\n",
    "    MERGE (b) - [:HAS_STATE] -> (state:State {validFrom: e.timestamp})\n",
    "    SET state.reserved = e.bookReserved\n",
    "    WITH m, b, e\n",
    "    CALL (m, b, e) {\n",
    "        MATCH (b) - [res:RESERVED_BY] -> (m)\n",
    "        WHERE res.validFrom <= e.timestamp\n",
    "        RETURN res ORDER BY res.validFrom DESC LIMIT 1\n",
    "    }\n",
    "    SET res.validTo = e.timestamp\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(update_remove_reservation_state_query)"
   ],
   "id": "ccda2eb5f5ff8c1b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 37
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:37.165364200Z",
     "start_time": "2026-03-23T15:10:37.004830200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# reserved by relationship does not yet exist (can only hold for the first remove reservation event for that book\n",
    "update_remove_reservation_state_query = '''\n",
    "    MATCH (b:Book) <- [:OBSERVES] - (e:Event)\n",
    "    MATCH (m:Member) <- [:OBSERVES] - (e:Event)\n",
    "    WHERE e.activity = 'Remove Reservation' AND NOT EXISTS ((b) - [:RESERVED_BY {validTo: e.timestamp}] -> (m)) //no reserved_by relationship exists yet\n",
    "    MERGE (b) - [:RESERVED_BY {validTo: e.timestamp, relIndex: -1}] -> (m)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(update_remove_reservation_state_query)"
   ],
   "id": "852b1cddd465eed6",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 38
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# complete states book",
   "id": "2ee53973ab371bee"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:37.793600100Z",
     "start_time": "2026-03-23T15:10:37.175878700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "order_states = '''\n",
    "MATCH (b:Book) - [:HAS_STATE] -> (st:State)\n",
    "WITH b, st ORDER BY st.validFrom\n",
    "WITH b, collect(st) as book_states\n",
    "UNWIND range(0, size(book_states) - 2) as index\n",
    "WITH book_states[index] as first, book_states[index+1] as second\n",
    "MERGE (first) - [:NEXT] -> (second)'''\n",
    "\n",
    "db_connection.exec_query(order_states)"
   ],
   "id": "df1b1a5a762d646d",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 39
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:38.520660200Z",
     "start_time": "2026-03-23T15:10:37.806911500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "copy_over_properties = '''\n",
    "    MATCH (b:Book) - [:HAS_STATE] ->  (st:State)\n",
    "    WHERE st[$prop] is NULL\n",
    "    MATCH (prev) - [:NEXT] -> (st)\n",
    "    SET st[$prop] = prev[$prop]\n",
    "    RETURN count(st) as count\n",
    "'''\n",
    "\n",
    "properties = ['reserved', 'available']\n",
    "for prop in properties:\n",
    "    count = 1\n",
    "    while count > 0:\n",
    "        result = db_connection.exec_query(query=Query(copy_over_properties,\n",
    "                                                      parameters={\"prop\": prop}))\n",
    "        count = result[0]['count']\n"
   ],
   "id": "4fb07e0e0394324a",
   "outputs": [],
   "execution_count": 40
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:39.153576400Z",
     "start_time": "2026-03-23T15:10:38.530065200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "determine_to_state = '''\n",
    "    MATCH (b:Book) - [:HAS_STATE] ->  (st:State)\n",
    "    MATCH (st) - [:NEXT] -> (successor)\n",
    "    SET st.validTo = successor.validFrom\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(determine_to_state)\n",
    "\n",
    "determine_to_end_state = '''\n",
    "    MATCH (b:Book) - [:HAS_STATE] ->  (st:State)\n",
    "    WHERE NOT EXISTS((st) - [:NEXT] -> (:State))\n",
    "    SET st.validTo = b.validTo\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(determine_to_end_state)"
   ],
   "id": "ca72c98b683f6495",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 41
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:39.325865900Z",
     "start_time": "2026-03-23T15:10:39.169660300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# check whether two following states have different properties, if result is 0 then they all have different properties\n",
    "check_following_states = '''\n",
    "MATCH (b:Book) - [:HAS_STATE] -> (st1:State) - [:NEXT] -> (st2:State)\n",
    "WHERE st1.available = st2.available AND st1.reserved = st2.reserved\n",
    "RETURN count(b) as book_with_same_states\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(check_following_states)"
   ],
   "id": "ebd18113ddc95222",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'book_with_same_states': 115}]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 42
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Complete BORROWED_BY relationship",
   "id": "371c4d652da14ebc"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:39.541442700Z",
     "start_time": "2026-03-23T15:10:39.326862200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query(Query(query_str='''\n",
    "                                         WITH datetime($start) as start_date, datetime($end) as end_date\n",
    "                                             MATCH (b:Book) - [bor:BORROWED_BY] -> (m:Member)\n",
    "                                         SET bor.validFrom = COALESCE (bor.validFrom, start_date)\n",
    "                                         ''',\n",
    "                               parameters={\n",
    "                                   \"start\": start,\n",
    "                                   \"end\": end\n",
    "                               }))"
   ],
   "id": "f5c3e4c4b921658",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 43
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:39.865885100Z",
     "start_time": "2026-03-23T15:10:39.555141800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query('''\n",
    "    MATCH (b:Book) - [bor:BORROWED_BY] -> (m:Member)\n",
    "   WITH b, m, bor.relIndex as relIndex, bor ORDER BY bor.validFrom\n",
    "   WITH b, m, relIndex, collect(bor) as same_rels\n",
    "   UNWIND range(0, size(same_rels) - 2) as index\n",
    "   WITH same_rels[index] as first, same_rels[index+1] as second\n",
    "   SET first.validTo = second.validFrom\n",
    "''')\n",
    "\n"
   ],
   "id": "4943bd12fb132815",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 44
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:40.086801Z",
     "start_time": "2026-03-23T15:10:39.882921700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query(Query(query_str='''\n",
    "                                         WITH datetime($start) as start_date, datetime($end) as end_date\n",
    "                                             MATCH (b:Book) - [bor:BORROWED_BY] -> (m:Member)\n",
    "                                         SET bor.validTo = COALESCE (bor.validTo, end_date)\n",
    "                                         ''',\n",
    "                               parameters={\n",
    "                                   \"start\": start,\n",
    "                                   \"end\": end\n",
    "                               }))"
   ],
   "id": "98a51940535a2360",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 45
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Complete RESERVED_BY relationship",
   "id": "f373748a35e0fd45"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:40.151706500Z",
     "start_time": "2026-03-23T15:10:40.095326600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query(Query(query_str='''\n",
    "                                         WITH datetime($start) as start_date, datetime($end) as end_date\n",
    "                                             MATCH (b:Book) - [res:RESERVED_BY] -> (m:Member)\n",
    "                                         SET res.validTo = COALESCE (res.validTo, end_date), res.validFrom = COALESCE (res.validFrom, start_date)\n",
    "                                         ''',\n",
    "                               parameters={\n",
    "                                   \"start\": start,\n",
    "                                   \"end\": end\n",
    "                               }))"
   ],
   "id": "4a99a93ff16cff70",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 46
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:40.177948500Z",
     "start_time": "2026-03-23T15:10:40.164797700Z"
    }
   },
   "cell_type": "code",
   "source": "# Add validity intervals to HAS_STATE",
   "id": "6a3f7f487388cd8a",
   "outputs": [],
   "execution_count": 47
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:41.746010800Z",
     "start_time": "2026-03-23T15:10:40.183074Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query(Query(query_str='''\n",
    "    :auto\n",
    "     MATCH (n) - [hs:HAS_STATE] -> (st:State)\n",
    "     CALL (st, hs) {\n",
    "     SET hs.validTo = st.validTo,\n",
    "        hs.validFrom = st.validFrom\n",
    "    } IN TRANSACTIONS\n",
    "     '''))"
   ],
   "id": "65fb3a6cb7ae90fd",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 48
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:41.783546700Z",
     "start_time": "2026-03-23T15:10:41.762551600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "end_build = datetime.datetime.now()\n",
    "print(f'Ended at {end_build}')"
   ],
   "id": "627a0080ed1d0990",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Ended at 2026-03-23 16:10:41.769383\n"
     ]
    }
   ],
   "execution_count": 49
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:41.818492800Z",
     "start_time": "2026-03-23T15:10:41.792776600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "start_constraint = datetime.datetime.now()\n",
    "print(f'Constraints at {start_constraint}')"
   ],
   "id": "6a6e1ae0bbba6ff",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Constraints at 2026-03-23 16:10:41.796959\n"
     ]
    }
   ],
   "execution_count": 50
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check semantic constraints for Member",
   "id": "a7efdde6839246b1"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:55.560673600Z",
     "start_time": "2026-03-23T15:10:41.823492600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "check_members_query = '''\n",
    "    :auto\n",
    "    MATCH (e:Event)\n",
    "    WHERE e.activity IN ['Register Member',\n",
    "                         'Deregister Member',\n",
    "                         'Borrow book',\n",
    "                         'Extend book',\n",
    "                         'Return book',\n",
    "                         'Reserve book',\n",
    "                         'Increase fine',\n",
    "                         'Pay fine']\n",
    "    CALL (e) {\n",
    "     RETURN\n",
    "     CASE e.activity\n",
    "     WHEN 'Register Member' THEN 'CREATE (Member exists from time of this event ' + e.activity + ' onwards)'\n",
    "     WHEN 'Deregister Member' THEN 'DELETE (Member exists until time of this event ' + e.activity + ')'\n",
    "     WHEN 'Increase fine' THEN 'UPDATE (Member has new state from time of this event ' + e.activity + ' onwards)'\n",
    "     WHEN 'Pay fine' THEN 'UPDATE (Member has new state from time of this event ' + e.activity + ' onwards)'\n",
    "     ELSE 'READ (Member exists at time of this event ' + e.activity + ')'\n",
    "     END AS constraint,\n",
    "    CASE e.activity\n",
    "     WHEN 'Register Member' THEN EXISTS ((e) - [:OBSERVES] -> (:Member {validFrom: e.timestamp}))\n",
    "     WHEN 'Deregister Member' THEN EXISTS ((e) - [:OBSERVES] -> (:Member {validTo: e.timestamp}))\n",
    "     WHEN 'Increase fine' THEN EXISTS {\n",
    "        (e) - [:OBSERVES] -> (:Member) - [:HAS_STATE] -> (st:State {validFrom: e.timestamp}) <- [:NEXT] - (prev:State)\n",
    "        WHERE any(k IN keys(prev)+keys(st) WHERE NOT k IN ['validFrom','validTo'] AND properties(st)[k] <> properties(prev)[k])\n",
    "     }\n",
    "     WHEN 'Pay fine' THEN EXISTS {\n",
    "        (e) - [:OBSERVES] -> (:Member) - [:HAS_STATE] -> (st:State {validFrom: e.timestamp}) <- [:NEXT] - (prev:State)\n",
    "        WHERE any(k IN keys(prev)+keys(st) WHERE NOT k IN ['validFrom','validTo'] AND properties(st)[k] <> properties(prev)[k])\n",
    "     }\n",
    "     ELSE EXISTS ((e) - [:OBSERVES] -> (:Member))\n",
    "\n",
    "    END AS satisfied_constraint\n",
    "    } IN TRANSACTIONS\n",
    "    WITH constraint, satisfied_constraint, e\n",
    "    WHERE satisfied_constraint = False\n",
    "    RETURN constraint, satisfied_constraint, count(e) ORDER BY constraint\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(check_members_query)\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "21832170d9a00ad2",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'constraint': 'UPDATE (Member has new state from time of this event Increase fine onwards)',\n",
       "  'satisfied_constraint': False,\n",
       "  'count(e)': 128},\n",
       " {'constraint': 'UPDATE (Member has new state from time of this event Pay fine onwards)',\n",
       "  'satisfied_constraint': False,\n",
       "  'count(e)': 1}]"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 51
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check semantic constraints for `Book`",
   "id": "f0c042e6238dfd18"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:56.444234500Z",
     "start_time": "2026-03-23T15:10:55.577433300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "check_books_query = '''\n",
    ":auto\n",
    "    MATCH (e:Event)\n",
    "    WHERE e.activity IN ['Add Book To Catalogue',\n",
    "                         'Remove Book from Catalogue',\n",
    "                         'Borrow book',\n",
    "                         'Extend book',\n",
    "                         'Return book',\n",
    "                         'Reserve book',\n",
    "                         'Remove Reservation']\n",
    "    CALL (e) {\n",
    "     RETURN\n",
    "     CASE e.activity\n",
    "     WHEN 'Add Book To Catalogue' THEN 'CREATE (Book exists from time of this event ' + e.activity + ' onwards)'\n",
    "     WHEN 'Remove Book from Catalogue' THEN 'DELETE (Book exists until time of this event ' + e.activity + ')'\n",
    "     WHEN 'Borrow book' THEN 'UPDATE (Book has new state from time of this event ' + e.activity + ' onwards)'\n",
    "     WHEN 'Extend book' THEN 'READ (Book exists at the time of this event ' + e.activity + ')'\n",
    "     WHEN 'Return book' THEN 'UPDATE (Book has new state from time of this event ' + e.activity + ' onwards)'\n",
    "     WHEN 'Reserve book' THEN 'UPDATE (Book has new state from time of this event ' + e.activity + ' onwards)'\n",
    "     WHEN 'Remove Reservation' THEN 'UPDATE (Book has new state from time of this event ' + e.activity + ' onwards)'\n",
    "     END AS constraint,\n",
    "    CASE e.activity\n",
    "     WHEN 'Remove Book from Catalogue' THEN EXISTS ((e) - [:OBSERVES] -> (:Book {validTo: e.timestamp}))\n",
    "     WHEN 'Add Book To Catalogue' THEN EXISTS ((e) - [:OBSERVES] -> (:Book {validFrom: e.timestamp}))\n",
    "     WHEN 'Borrow book' THEN EXISTS {\n",
    "        (e) - [:OBSERVES] -> (:Book) - [:HAS_STATE] -> (st:State {validFrom: e.timestamp}) <- [:NEXT] - (prev:State)\n",
    "        WHERE any(k IN keys(prev)+keys(st) WHERE NOT k IN ['validFrom','validTo'] AND properties(st)[k] <> properties(prev)[k])\n",
    "     }\n",
    "     WHEN 'Extend book' THEN EXISTS ((e) - [:OBSERVES] -> (:Book))\n",
    "     WHEN 'Return book' THEN EXISTS {\n",
    "        (e) - [:OBSERVES] -> (:Book) - [:HAS_STATE] -> (st:State {validFrom: e.timestamp}) <- [:NEXT] - (prev:State)\n",
    "        WHERE any(k IN keys(prev)+keys(st) WHERE NOT k IN ['validFrom','validTo'] AND properties(st)[k] <> properties(prev)[k])\n",
    "     }\n",
    "     WHEN 'Reserve book' THEN EXISTS {\n",
    "        (e) - [:OBSERVES] -> (:Book) - [:HAS_STATE] -> (st:State {validFrom: e.timestamp}) <- [:NEXT] - (prev:State)\n",
    "        WHERE any(k IN keys(prev)+keys(st) WHERE NOT k IN ['validFrom','validTo'] AND properties(st)[k] <> properties(prev)[k])\n",
    "     }\n",
    "     WHEN 'Remove Reservation' THEN EXISTS {\n",
    "        (e) - [:OBSERVES] -> (:Book) - [:HAS_STATE] -> (st:State {validFrom: e.timestamp}) <- [:NEXT] - (prev:State)\n",
    "        WHERE any(k IN keys(prev)+keys(st) WHERE NOT k IN ['validFrom','validTo'] AND properties(st)[k] <> properties(prev)[k])\n",
    "     }\n",
    "\n",
    "    END AS satisfied_constraint\n",
    "    } IN TRANSACTIONS\n",
    "    WITH constraint, satisfied_constraint, e\n",
    "    WHERE satisfied_constraint = False\n",
    "    RETURN constraint,satisfied_constraint, count(e)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(check_books_query)\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "b291439cb19c4ecd",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'constraint': 'UPDATE (Book has new state from time of this event Borrow book onwards)',\n",
       "  'satisfied_constraint': False,\n",
       "  'count(e)': 26}]"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 52
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check Semantic Constraints for `IN_CATALOG`",
   "id": "5d146d8e4116c530"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:56.694210200Z",
     "start_time": "2026-03-23T15:10:56.465825800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "check_in_catalog_query = '''\n",
    ":auto\n",
    "    MATCH (e:Event)\n",
    "    WHERE e.activity IN ['Add Book To Catalogue',\n",
    "                         'Remove Book from Catalogue']\n",
    "CALL (e) {\n",
    "     RETURN\n",
    "     CASE e.activity\n",
    "     WHEN 'Add Book To Catalogue' THEN 'CREATE (IN_CATALOG exists from time of this event ' + e.activity + ' onwards)'\n",
    "     WHEN 'Remove Book from Catalogue' THEN 'DELETE (IN_CATALOG exists until time of this event ' + e.activity + ')'\n",
    "     END AS constraint,\n",
    "    CASE e.activity\n",
    "\n",
    "     WHEN 'Add Book To Catalogue' THEN EXISTS ((e) - [:OBSERVES] -> (:Book) <- [:IN_CATALOG {validFrom: e.timestamp}] - (:Library))\n",
    "     WHEN 'Remove Book from Catalogue' THEN EXISTS ((e) - [:OBSERVES] -> (:Book) <- [:IN_CATALOG {validTo: e.timestamp}] - (:Library))\n",
    "\n",
    "    END AS satisfied_constraint\n",
    "    } IN TRANSACTIONS\n",
    "    WITH constraint, satisfied_constraint, e\n",
    "    WHERE satisfied_constraint = False\n",
    "    RETURN constraint,satisfied_constraint, count(e)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(check_in_catalog_query)\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "24924c203186c9ac",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 53
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check Semantic Constraints for 'BORROWED_BY'",
   "id": "eb3d9b0fbd1c49ec"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:57.612410800Z",
     "start_time": "2026-03-23T15:10:56.709918700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "check_query = '''\n",
    ":auto\n",
    "MATCH (e:Event)\n",
    "WHERE e.activity IN ['Borrow book', 'Extend book', 'Return book']\n",
    "CALL (e) {\n",
    "RETURN\n",
    "     CASE e.activity\n",
    "     WHEN 'Borrow book' THEN 'CREATE (BORROWED_BY exists from time of this event ' + e.activity + ' onwards)'\n",
    "     WHEN 'Extend book' THEN 'UPDATE (BORROWED_BY is updated at the time of this event ' + e.activity + ')'\n",
    "     WHEN 'Return book' THEN 'DELETE (BORROWED_BY is deleted at the time of this event ' + e.activity + ')'\n",
    "     END AS constraint,\n",
    "\n",
    "CASE e.activity\n",
    "WHEN 'Borrow book' THEN  EXISTS{(e) - [:OBSERVES] -> (:Book) - [bor:BORROWED_BY] -> (:Member) WHERE bor.validFrom = e.timestamp}\n",
    "WHEN 'Extend book' THEN EXISTS{(e) - [:OBSERVES] -> (b:Book) - [bor:BORROWED_BY] -> (:Member) <- [prev_bor:BORROWED_BY] - (b:Book)\n",
    "    WHERE bor.validFrom = e.timestamp AND prev_bor.validTo = e.timestamp\n",
    "    AND any(k IN keys(prev_bor)+keys(bor) WHERE NOT k IN ['validFrom','validTo', 'relIndex'] AND properties(prev_bor)[k] <> properties(bor)[k])\n",
    "}\n",
    "WHEN 'Return book' THEN EXISTS{(e) - [:OBSERVES] -> (:Book) - [bor:BORROWED_BY] -> (:Member) WHERE bor.validTo = e.timestamp}\n",
    "END AS satisfied_constraint\n",
    "    } IN TRANSACTIONS\n",
    "    WITH constraint, satisfied_constraint, e\n",
    "    WHERE satisfied_constraint = False\n",
    "    RETURN constraint,satisfied_constraint, count(e)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(check_query)\n",
    "\n",
    "# # if an empty list is returned [] then no violations detected"
   ],
   "id": "278699fb84516a95",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 54
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check Semantic Constraints for `RESERVED_BY`",
   "id": "f7dc430a42cc079d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:57.866504100Z",
     "start_time": "2026-03-23T15:10:57.629385100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "check_query = '''\n",
    ":auto\n",
    "MATCH (e:Event)\n",
    "WHERE e.activity IN ['Reserve book', 'Remove Reservation']\n",
    "CALL (e) {\n",
    "RETURN\n",
    "     CASE e.activity\n",
    "     WHEN 'Reserve book' THEN 'CREATE (RESERVED_BY exists from time of this event ' + e.activity + ' onwards)'\n",
    "     WHEN 'Remove Reservation' THEN 'DELETE (RESERVED_BY is deleted at the time of this event ' + e.activity + ')'\n",
    "     END AS constraint,\n",
    "\n",
    "CASE e.activity\n",
    "WHEN 'Reserve book' THEN  EXISTS{(e) - [:OBSERVES] -> (:Book) - [res:RESERVED_BY] -> (:Member) WHERE res.validFrom = e.timestamp}\n",
    "WHEN 'Remove Reservation' THEN EXISTS{(e) - [:OBSERVES] -> (:Book) - [res:RESERVED_BY] -> (:Member) WHERE res.validTo = e.timestamp}\n",
    "END AS satisfied_constraint\n",
    "    } IN TRANSACTIONS\n",
    "    WITH constraint, satisfied_constraint, e\n",
    "    WHERE satisfied_constraint = False\n",
    "    RETURN constraint,satisfied_constraint, count(e)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(check_query)\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "1f6be69797ea4c18",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 55
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check IT-OCED Specifications",
   "id": "795b8c942f213bda"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:58.454293900Z",
     "start_time": "2026-03-23T15:10:57.867504600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Every node has a validFrom and validTo\n",
    "db_connection.exec_query('''\n",
    "    MATCH (n)\n",
    "    RETURN n.validFrom is not null as has_start, n.validTo is not null as has_end, count(n)\n",
    "''')"
   ],
   "id": "38d183d7bc3cfc78",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'has_start': True, 'has_end': True, 'count(n)': 333214}]"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 56
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:58.798248300Z",
     "start_time": "2026-03-23T15:10:58.470888400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# All nodes with states have a state starting at start of the object, ending at end of the object and there are no states superseding and exceeding the object validity\n",
    "db_connection.exec_query('''\n",
    "    MATCH (n) - [:HAS_STATE] -> (state:State)\n",
    "    WITH n,\n",
    "        min(state.validFrom) AS min_state_start,\n",
    "        max(state.validTo)   AS max_state_end\n",
    "    RETURN  max_state_end = n.validTo as has_valid_start,\n",
    "            min_state_start = n.validFrom as has_valid_end,\n",
    "    count(n)\n",
    "''')"
   ],
   "id": "a3ca7bcf2ae7a970",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'has_valid_start': True, 'has_valid_end': True, 'count(n)': 8224}]"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 57
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:59.172678300Z",
     "start_time": "2026-03-23T15:10:58.812621900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# two subsequent states have no gap\n",
    "db_connection.exec_query('''\n",
    "    MATCH (n) - [:HAS_STATE] -> (st1:State) - [:NEXT] -> (st2:State)\n",
    "    RETURN st1.validTo = st2.validFrom as no_gap, count(n)\n",
    "''')"
   ],
   "id": "552e5f8e66e9623",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'no_gap': True, 'count(n)': 161288}]"
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 58
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:10:59.759278600Z",
     "start_time": "2026-03-23T15:10:59.187466400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# relation have a validity interval\n",
    "db_connection.exec_query('''\n",
    "    MATCH (n) - [rel] -> (n2)\n",
    "    WHERE type(rel) <> 'NEXT'\n",
    "    RETURN rel.validFrom is not null as has_start, rel.validTo is not null as has_end, count(rel)\n",
    "''')"
   ],
   "id": "87fcd9d4ca1a8deb",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'has_start': True, 'has_end': True, 'count(rel)': 419337}]"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 59
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:01.395776Z",
     "start_time": "2026-03-23T15:10:59.772317100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# relation only holds when other sides hold\n",
    "db_connection.exec_query('''\n",
    "    MATCH (n) - [rel] -> (n2)\n",
    "    WHERE rel.validFrom is not null and rel.validTo is not null\n",
    "\n",
    "    WITH rel, n, n2,\n",
    "        CASE WHEN n.validFrom >= n2.validFrom THEN n.validFrom ELSE n2.validFrom END AS start, //take max(n.validFrom, n2.validFrom)\n",
    "        CASE WHEN n.validTo <= n2.validTo THEN n.validTo ELSE n2.validTo END AS end //take min(n.validTo, n2.validTo)\n",
    "\n",
    "    RETURN start <= rel.validFrom, rel.validTo <= end, count(rel)\n",
    "''')"
   ],
   "id": "ddbd35424e755b97",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'start <= rel.validFrom': True,\n",
       "  'rel.validTo <= end': True,\n",
       "  'count(rel)': 419337}]"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 60
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check Snapshot Cardinality Constraints",
   "id": "29c884ea12a8c5e7"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## BORROWED_BY\n",
    "\n",
    "BORROWED_BY is a binary relationship between Book and Member with the following snapshot cardinalities:\n",
    "\n",
    "- Book → Member: 0..1 at any point in time (a book may be borrowed by at most one member simultaneously)\n",
    "- Member → Book: 0..5 at any point in time (a member may borrow at most five books simultaneously)"
   ],
   "id": "d0f1a114eb44eb06"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "First, we check `Book → Member: 0..1` at any point in time",
   "id": "dbef6bc60fff2c11"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:01.614631600Z",
     "start_time": "2026-03-23T15:11:01.410523900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "snapshot_cardinality_0_1_check = '''\n",
    "    MATCH (n:$first_label)-[r:$rel_type]-(:$second_label)\n",
    "    WITH n, r ORDER BY r.validFrom\n",
    "    WITH n, collect(r) AS iv\n",
    "    WITH n, iv[0..-1] AS iv1, iv[1..] AS iv2\n",
    "    UNWIND range(0, size(iv2)-2) AS k\n",
    "    WITH n, iv1[k] AS prev, iv2[k] AS next, k, iv2\n",
    "    WHERE next.validFrom < prev.validTo\n",
    "    RETURN DISTINCT n.sysId\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(Query(\n",
    "    query_str=snapshot_cardinality_0_1_check,\n",
    "    template_string_parameters={\n",
    "        'rel_type': 'BORROWED_BY',\n",
    "        'first_label': 'Book',\n",
    "        'second_label': 'Member'\n",
    "    }\n",
    "))\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "215ec5120a362d31",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n.sysId': '0114688'},\n",
       " {'n.sysId': '0131306'},\n",
       " {'n.sysId': '0114680'},\n",
       " {'n.sysId': '019288'},\n",
       " {'n.sysId': '0115788'},\n",
       " {'n.sysId': '015356'},\n",
       " {'n.sysId': '0130403'},\n",
       " {'n.sysId': '0114026'},\n",
       " {'n.sysId': '0141663'},\n",
       " {'n.sysId': '015821'},\n",
       " {'n.sysId': '0111597'},\n",
       " {'n.sysId': '0123847'},\n",
       " {'n.sysId': '0121621'},\n",
       " {'n.sysId': '0113737'},\n",
       " {'n.sysId': '0131507'},\n",
       " {'n.sysId': '013301'},\n",
       " {'n.sysId': '0113733'},\n",
       " {'n.sysId': '0137594'},\n",
       " {'n.sysId': '014595'},\n",
       " {'n.sysId': '0132750'},\n",
       " {'n.sysId': '013692'},\n",
       " {'n.sysId': '0135805'},\n",
       " {'n.sysId': '0119485'},\n",
       " {'n.sysId': '0134941'},\n",
       " {'n.sysId': '0117461'},\n",
       " {'n.sysId': '012804'},\n",
       " {'n.sysId': '0124601'},\n",
       " {'n.sysId': '0121353'},\n",
       " {'n.sysId': '0124337'},\n",
       " {'n.sysId': '0113619'},\n",
       " {'n.sysId': '0125025'},\n",
       " {'n.sysId': '0127253'},\n",
       " {'n.sysId': '0127932'},\n",
       " {'n.sysId': '0138977'},\n",
       " {'n.sysId': '0117018'},\n",
       " {'n.sysId': '0138469'},\n",
       " {'n.sysId': '0118878'},\n",
       " {'n.sysId': '0128539'},\n",
       " {'n.sysId': '0137674'},\n",
       " {'n.sysId': '0141538'},\n",
       " {'n.sysId': '0118683'},\n",
       " {'n.sysId': '0119512'},\n",
       " {'n.sysId': '0111225'},\n",
       " {'n.sysId': '0143780'},\n",
       " {'n.sysId': '0116188'},\n",
       " {'n.sysId': '0129920'},\n",
       " {'n.sysId': '0141804'},\n",
       " {'n.sysId': '018515'},\n",
       " {'n.sysId': '0143423'},\n",
       " {'n.sysId': '0115209'},\n",
       " {'n.sysId': '0125409'},\n",
       " {'n.sysId': '0113731'},\n",
       " {'n.sysId': '01420'},\n",
       " {'n.sysId': '018765'},\n",
       " {'n.sysId': '0130043'},\n",
       " {'n.sysId': '0112990'},\n",
       " {'n.sysId': '0111917'},\n",
       " {'n.sysId': '018746'},\n",
       " {'n.sysId': '0136216'},\n",
       " {'n.sysId': '0123224'},\n",
       " {'n.sysId': '0113460'},\n",
       " {'n.sysId': '0137780'},\n",
       " {'n.sysId': '0121671'},\n",
       " {'n.sysId': '015055'},\n",
       " {'n.sysId': '0144882'},\n",
       " {'n.sysId': '0113164'},\n",
       " {'n.sysId': '013483'},\n",
       " {'n.sysId': '0124006'},\n",
       " {'n.sysId': '0137060'},\n",
       " {'n.sysId': '0144881'},\n",
       " {'n.sysId': '0122580'},\n",
       " {'n.sysId': '0118843'},\n",
       " {'n.sysId': '0181'},\n",
       " {'n.sysId': '0114300'},\n",
       " {'n.sysId': '016425'},\n",
       " {'n.sysId': '0115650'},\n",
       " {'n.sysId': '0129718'},\n",
       " {'n.sysId': '0128559'},\n",
       " {'n.sysId': '011667'},\n",
       " {'n.sysId': '0135291'},\n",
       " {'n.sysId': '0122288'}]"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 61
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Next, we check `Member → Book: 0..5` at any point in time",
   "id": "daad5ae00ac4c59f"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:01.966814200Z",
     "start_time": "2026-03-23T15:11:01.622982Z"
    }
   },
   "cell_type": "code",
   "source": [
    "snapshot_cardinality_0_limited_n_check = '''\n",
    "    MATCH (n:$first_label)-[r:$rel_type]-(:$second_label)\n",
    "    WITH n, collect(r) AS iv\n",
    "\n",
    "    // Compare only adjacent pairs to detect any overlap,\n",
    "    // but we also need peak concurrency (K>1), which requires a sweep.\n",
    "    // For clarity, use the event-based solution above for true K>1 checks.\n",
    "    WITH n,\n",
    "         [r IN iv | {t: r.validTo, delta: -1, kind: 0}] +\n",
    "         [r IN iv | {t: r.validFrom, delta: +1, kind: 1}] AS updateCounts\n",
    "    UNWIND updateCounts AS update\n",
    "    WITH n, update\n",
    "    ORDER BY elementId(n), update.t, update.kind\n",
    "    WITH n, collect(update) AS updates\n",
    "    WITH n,\n",
    "         reduce(acc = {cur:0, max:0}, x IN updates |\n",
    "           {cur: acc.cur + x.delta,\n",
    "            max: CASE WHEN acc.cur + x.delta > acc.max THEN acc.cur + x.delta ELSE acc.max END}) AS r\n",
    "    WHERE r.max > $max_limit\n",
    "    RETURN n.sysId, r.max AS peak\n",
    "    ORDER BY peak DESC;\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(Query(\n",
    "    query_str=snapshot_cardinality_0_limited_n_check,\n",
    "    template_string_parameters={\n",
    "        'rel_type': 'BORROWED_BY',\n",
    "        'first_label': 'Member',\n",
    "        'second_label': 'Book',\n",
    "    },\n",
    "    parameters={\n",
    "        'max_limit': 5\n",
    "    }\n",
    "))\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "6859a806d197fc17",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n.sysId': 'M029', 'peak': 9},\n",
       " {'n.sysId': 'M335', 'peak': 9},\n",
       " {'n.sysId': 'M096', 'peak': 8},\n",
       " {'n.sysId': 'M196', 'peak': 8},\n",
       " {'n.sysId': 'M306', 'peak': 8},\n",
       " {'n.sysId': 'M591', 'peak': 8},\n",
       " {'n.sysId': 'M593', 'peak': 8},\n",
       " {'n.sysId': 'M747', 'peak': 8},\n",
       " {'n.sysId': 'M788', 'peak': 8},\n",
       " {'n.sysId': 'M1023', 'peak': 8},\n",
       " {'n.sysId': 'M1175', 'peak': 8},\n",
       " {'n.sysId': 'M013', 'peak': 7},\n",
       " {'n.sysId': 'M065', 'peak': 7},\n",
       " {'n.sysId': 'M163', 'peak': 7},\n",
       " {'n.sysId': 'M165', 'peak': 7},\n",
       " {'n.sysId': 'M288', 'peak': 7},\n",
       " {'n.sysId': 'M322', 'peak': 7},\n",
       " {'n.sysId': 'M351', 'peak': 7},\n",
       " {'n.sysId': 'M367', 'peak': 7},\n",
       " {'n.sysId': 'M464', 'peak': 7},\n",
       " {'n.sysId': 'M656', 'peak': 7},\n",
       " {'n.sysId': 'M691', 'peak': 7},\n",
       " {'n.sysId': 'M828', 'peak': 7},\n",
       " {'n.sysId': 'M896', 'peak': 7},\n",
       " {'n.sysId': 'M997', 'peak': 7},\n",
       " {'n.sysId': 'M1174', 'peak': 7},\n",
       " {'n.sysId': 'M1186', 'peak': 7},\n",
       " {'n.sysId': 'M404', 'peak': 6},\n",
       " {'n.sysId': 'M522', 'peak': 6},\n",
       " {'n.sysId': 'M586', 'peak': 6},\n",
       " {'n.sysId': 'M619', 'peak': 6},\n",
       " {'n.sysId': 'M646', 'peak': 6},\n",
       " {'n.sysId': 'M967', 'peak': 6},\n",
       " {'n.sysId': 'M1012', 'peak': 6},\n",
       " {'n.sysId': 'M1113', 'peak': 6},\n",
       " {'n.sysId': 'M1095', 'peak': 6}]"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 62
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## RESERVED_BY\n",
    "\n",
    "RESERVED_BY is a binary relationship between Book and Member with the following snapshot cardinalities:\n",
    "\n",
    "- Book → Member: 0..1 at any point in time (a book may be reserved by at most one member simultaneously)\n",
    "- Member → Book: 0..5 at any point in time (a member may reserve at most five books simultaneously)"
   ],
   "id": "6117dcff9505d654"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "First, we check `Book → Member: 0..1` at any point in time",
   "id": "85b7da20bd1a942f"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.043347600Z",
     "start_time": "2026-03-23T15:11:01.978838700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query(Query(\n",
    "    query_str=snapshot_cardinality_0_1_check,\n",
    "    template_string_parameters={\n",
    "        'rel_type': 'RESERVED_BY',\n",
    "        'first_label': 'Book',\n",
    "        'second_label': 'Member'\n",
    "    }\n",
    "))\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "3bf2cd75c1d1d4ef",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 63
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Then, we check `Member → Book: 0..5` at any point in time",
   "id": "cdfae5ca4cb8d5aa"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.144648100Z",
     "start_time": "2026-03-23T15:11:02.057595200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query(Query(\n",
    "    query_str=snapshot_cardinality_0_limited_n_check,\n",
    "    template_string_parameters={\n",
    "        'rel_type': 'RESERVED_BY',\n",
    "        'first_label': 'Member',\n",
    "        'second_label': 'Book',\n",
    "    },\n",
    "    parameters={\n",
    "        'max_limit': 5\n",
    "    }\n",
    "))\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "8e20eaeb5084510f",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 64
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## IN_CATALOG\n",
    "\n",
    "IN_CATALOG is a binary relationship between Book and Library with the following snapshot cardinalities:\n",
    "\n",
    "- Book → Library: 1..1 at any point in time (a book should always be in the catalog of exactly one library simultaneously)\n",
    "- Library → Book: 0..n at any point in time (a library may have an unlimited books in its catalog simultaneously)"
   ],
   "id": "11ae280cb4f4da46"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "First, we check `Book → Library: 1..1` at any point in time",
   "id": "ffebfac0a0d001a"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.235084300Z",
     "start_time": "2026-03-23T15:11:02.157839100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "snapshot_cardinality_1_1_check = '''\n",
    "    MATCH (n:$first_label)-[r:$rel_type]-(:$second_label)\n",
    "    WITH n, r ORDER BY r.validFrom\n",
    "    WITH n, collect(r) AS iv\n",
    "    WITH n, iv[0] as first, iv[0..-1] AS iv1, iv[1..] AS iv2, iv[-1] as last\n",
    "    UNWIND range(0, size(iv2)-2) AS k\n",
    "    WITH n, first, last, iv1[k] AS prev, iv2[k] AS next, k, iv2\n",
    "    WHERE first.validFrom <> n.validFrom // starts too late or too early\n",
    "          OR  n.validTo <> last.validTo // end too late or too early\n",
    "          OR next.validFrom <> prev.validTo // gap or overlap\n",
    "    RETURN DISTINCT n, prev, next\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(Query(\n",
    "    query_str=snapshot_cardinality_1_1_check,\n",
    "    template_string_parameters={\n",
    "        'rel_type': 'IN_CATALOG',\n",
    "        'first_label': 'Book',\n",
    "        'second_label': 'Library'\n",
    "    }\n",
    "))\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "471b16e961bb5e9e",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 65,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 65
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "`Library → Book: 0..n` at any point in time (a library may have an unlimited books in its catalog simultaneously)\n",
    "This does not require any check"
   ],
   "id": "970feea0ced3dcc4"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Member Of\n",
    "\n",
    "MEMBER_OF is a binary relationship between Member and Library with the following snapshot cardinalities:\n",
    "\n",
    "- Member → Library: 1..n at any point in time (a member should always be a member of at least one library simultaneously)\n",
    "- Library → Member: 0..n at any point in time (a library may have an unlimited number of members simultaneously)\n",
    "\n"
   ],
   "id": "6090b9310c0c3595"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.318506100Z",
     "start_time": "2026-03-23T15:11:02.245593200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "snapshot_cardinality_1_n_check = '''\n",
    "    MATCH (n:$first_label)-[r:$rel_type]-(:$second_label)\n",
    "    WITH n, r ORDER BY r.validFrom\n",
    "    WITH n, collect(r) AS iv\n",
    "    WITH n, iv[0] as first, iv[0..-1] AS iv1, iv[1..] AS iv2, iv[-1] as last\n",
    "    UNWIND range(0, size(iv2)-2) AS k\n",
    "    WITH n, first, last, iv1[k] AS prev, iv2[k] AS next, k, iv2\n",
    "    WHERE first.validFrom <> n.validFrom // starts too late or too early\n",
    "          OR  n.validTo <> last.validTo // end too late or too early\n",
    "          OR next.validFrom > prev.validTo // gap between intervals\n",
    "    RETURN DISTINCT n, prev, next\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(Query(\n",
    "    query_str=snapshot_cardinality_1_n_check,\n",
    "    template_string_parameters={\n",
    "        'rel_type': 'MEMBER_OF',\n",
    "        'first_label': 'Member',\n",
    "        'second_label': 'Library'\n",
    "    }\n",
    "))\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "bade40384b8ba04a",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 66
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Lifetime Constraints\n",
    "\n",
    "In our library, a book can be borrowed over its lifetime at most 10 times."
   ],
   "id": "aaf11b78c29458f3"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.539300300Z",
     "start_time": "2026-03-23T15:11:02.331598500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "lifetime_cardinality_max_check = '''\n",
    "    MATCH (n:$first_label)-[r:$rel_type]-(n2:$second_label)\n",
    "    WITH n, n2, count(distinct r.relIndex) as num_rel_between\n",
    "    WITH n, sum(num_rel_between) as lifetime_rel\n",
    "    WHERE NOT ($min_lifetime <= lifetime_rel <= $max_lifetime)\n",
    "    RETURN distinct n.sysId as violating_constraint, lifetime_rel\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(Query(\n",
    "    query_str=lifetime_cardinality_max_check,\n",
    "    template_string_parameters={\n",
    "        'rel_type': 'BORROWED_BY',\n",
    "        'first_label': 'Book',\n",
    "        'second_label': 'Member',\n",
    "        'min_lifetime': 0,\n",
    "        'max_lifetime': 10\n",
    "    }\n",
    "))\n",
    "\n",
    "# if an empty list is returned [] then no violations detected"
   ],
   "id": "9955f513a5cdfdd6",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 67
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.559943200Z",
     "start_time": "2026-03-23T15:11:02.540294200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "end_constraint = datetime.datetime.now()\n",
    "print(f'Constraints finished at {end_constraint}')"
   ],
   "id": "6350f773ac033b2c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Constraints finished at 2026-03-23 16:11:02.543431\n"
     ]
    }
   ],
   "execution_count": 68
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Print some statistics",
   "id": "645027f0a8cd247a"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.599307600Z",
     "start_time": "2026-03-23T15:11:02.570528100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "building_time = end_build - start_build\n",
    "constraint_checking = end_constraint - start_constraint\n",
    "print(f'Building time: {building_time}')\n",
    "print(f'Constraint Checking time: {constraint_checking}')"
   ],
   "id": "ecfb9a45a2a8ec17",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Building time: 0:01:31.315383\n",
      "Constraint Checking time: 0:00:20.746472\n"
     ]
    }
   ],
   "execution_count": 69
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.631646800Z",
     "start_time": "2026-03-23T15:11:02.605825800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query('''\n",
    "    MATCH (e:Event)\n",
    "    RETURN count(e) as eventCount\n",
    "''')"
   ],
   "id": "5f0124ee3b8fb5d5",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'eventCount': 155477}]"
      ]
     },
     "execution_count": 70,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 70
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.678224400Z",
     "start_time": "2026-03-23T15:11:02.643160400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query('''\n",
    "    MATCH (m:Member)\n",
    "    RETURN count(m) as memberCount\n",
    "''')"
   ],
   "id": "839e66c549535f2c",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'memberCount': 1224}]"
      ]
     },
     "execution_count": 71,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 71
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:02.736954400Z",
     "start_time": "2026-03-23T15:11:02.692333600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query('''\n",
    "    MATCH (b:Book)\n",
    "    RETURN count(b) as bookCount\n",
    "''')"
   ],
   "id": "9c1c30d37fa8331d",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'bookCount': 7000}]"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 72
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2026-03-23T15:11:04.471618500Z",
     "start_time": "2026-03-23T15:11:02.738954200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_connection.exec_query('''\n",
    ":auto\n",
    "    MATCH (n) - [rel] -> (n2)\n",
    "    WHERE type(rel) <> 'NEXT' AND type(rel) <> 'HAS_STATE'\n",
    "    CALL (n, rel, n2) {\n",
    "        WITH type(rel) as type, n, n2, rel.relIndex as idx, count(rel) as count\n",
    "        RETURN type, count\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN type = 'OBSERVES' as observed, sum(count)\n",
    "''')"
   ],
   "id": "987ff1a61bb07e6d",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'observed': False, 'sum(count)': 43445},\n",
       " {'observed': True, 'sum(count)': 206380}]"
      ]
     },
     "execution_count": 73,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 73
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
